export const scenarioDetail1 = {
    flag : 'T',
    idx : 1,
    date : '296. 04. 01',
    title: '튜토리얼 I',
    subtitle: '베텔기우스 전역',
    pts : 1000,
    useYn : true,
    preview : [
      '서기 2801년.\n알데바란 성계 제2행성 테오리아.',
      '이 곳에서 시리우스 전역 이후 이어진 90년간의 혼란기가 종식되고,\n인류는 하나로 통합되었다.',
      '우주력 1년을 원년으로한 은하연방의 시작이었다.',
      '그로부터 인류는 황금기를 누리며 인구, 과학, 문화를 기하급수적으로 발전시키고 더 먼 우주로 영토를 확장시킨다.',
      '그렇게 2세기가 지났다.\n이 때부터 연방사회에 있었던 사회적 문제들이 본격적으로 터져나오기 시작했다.',
      '권태, 태만, 피로, 소극 등 부정적인 감정이 연방을 지배했고 인류사회는 이른바 \'중세적 정체(停滯)\'를 맞이하게 되었다. ',
      '새로운 발명과 발견은 명맥이 끊겼고, 민주주의는 자정능력을 잃어 중우정치로 타락했다.',
      '그 결과 변경 성역 개발 계획은 폐기되었으며, 식민지는 버려졌다.',
      '사회와 문화는 퇴폐 일로를 걸었고, 사람들은 타락하여 마약, 폭력에 빠져들었다.',
      '범죄율은 나날이 증가했고 검거율은 줄어들었으며 사람들은 도덕을 비웃고 생명을 경시했다.',
      '이렇게 연방은 서서히 썩어들어가고 있었다...',
      '마치 질식할 것만 같은 사회 분위기...',
      '지쳐가던 사람들은 모든 사회문제를 통쾌하게 해결하고 자신들이 힘겹게 지고 있던 고통을 대신 떠안아줄 \'영웅\'의 등장을 갈망하게 되었다.',
      '그리고 우주력 296년. 해적들이 들끓던 베텔기우스 지역을 평정한 \'영웅\'이 등장한다.'
    ],
    previewImg : [
      'images/planet/Aldebaran/Aldebaran.webp',
      'images/event/scenario/01/GalacticFederation.webp',
      'images/planet/Aldebaran/Theoria.webp',
      'images/event/scenario/01/PlvsVltra.webp',
      '',
      '',
      '',
      '',
      '',
      '',
      '',
    ],
    subInfo : [
      { idx : 1,
        displayType : 'C',
        data : 'CH_000089',
        img : 'images/person/CH_000089N_H.webp',
        text : ['이 시나리오는 은하제국을 건설할 루돌프 폰 골덴바움으로만 플레이 가능합니다.',]
      },
    ],
    mission: [
      { idx : 1,
        title :'해적함대를 남김없이 소탕하세요.',
        disc : ['이 시나리오는 오로지 루돌프로만 진행이 가능합니다.',
                '시나리오의 시작 시점에 루돌프는 해적의 잔당과 전투를 치르고 있습니다.',
                '전투를 성공적으로 이끄세요.',
                '살아남은 해적이 적을 수록 이후 목표에 도움이 됩니다.',
              ],
        achieveId : ['1-1']
      }
    ],
    missonAchieve: [
      { id : '1-1', 
        desc: ''
      }
    ],
    rewards: [

    ],
}
