// scenarioMeta.js
export const scenarioMeta = [
  {
    flag : 'T',
    idx : 0,
    date : '640. 07. 14',
    title: '튜토리얼-1',
    subtitle: '다곤 성역 회전',
    desc : '우주력 640년, 제국력 331년. 2월\n'
          +'은하제국군은 변경지역을 순찰하던 도중 새로운 세력과 조우하게 된다.\n'
          +'순찰 함대는 크게 당황하여 제대로 된 대응도 못한 채 전멸하게 되었다는 교신만 남긴 채 사라지고 만다.\n'
          +'200여년전 탈출한 수십만명의 공화주의자들로 추정되는 이 세력을 토벌하기 위해 은하제국의 20대 황제인 프리드리히 3세는 원정군을 준비하는데...\n'
  },
  {
    flag : 'T',
    idx : 1,
    date : '788. 05. 01',
    title: '튜토리얼-2',
    subtitle: '엘 파실 전투',
    desc : ''
  },
  {
    date : '792. 05. 06',
    title: '황금의 날개',
    subtitle: '제 5차 이제르론 공방전',
    desc : '제2차 티아마트 회전에서 대참패한 은하제국은 제국령과 동맹령을 연결하는 사실상 유일한 통로인 이제르론 회랑에 요새를 건설하였다.<br>'
          +'자유행성동맹 입장에서는 저 이제르론 요새를 넘지 못하면 제국령으로 침입할 수가 없었다.<br>'
          +'하지만 이제르론 요새는 함포사격으로는 피해를 줄 수 없는 두터운 장갑을 갖추고 있었고, 여기에 1만 척 이상의 주둔함대와 강력한 요새주포 토르 하머까지 있었기에 앞선 네 차례의 공세는 동맹군이 일방적으로 박살나는 것으로 마무리되었다.<br>'
          +'동맹 입장에서는 이 불명예스러운 기록을 늘리고 싶지 않았고, 이에 대병력을 동원하여 이제르론 공략 작전에 착수하였다.<br>'
  },
];